CREATE DATABASE frdg;
use frdg;

drop table users;

CREATE TABLE users(
    id int NOT NULL AUTO_INCREMENT,
    uid varchar(30) NOT NULL,
    name varchar(30) NOT NULL,
    psword varchar(30) NOT NULL,
    age varchar(30) NOT NULL,
    gen varchar(30) NOT NULL,
    country varchar(30) NOT NULL,
    email varchar(30) NOT NULL,
    in_date datetime DEFAULT current_timestamp,

    PRIMARY KEY (id)
);


INSERT INTO users(uid,name,psword,age,gen,country,email)
    values("lls","steve","123",42,"여","uzbekistan","lsdf@google.co.kr"),
    ("asd","alice","123",33,"여","USA","lvvcdf@google.co.kr"),
    ("ees","billy","1234",67,"남","korea","lsaaaf@google.co.kr"),
    ("abv","mike","1w3",19,"여","japan","lsasdsdf@google.co.kr"),
    ("ewq","andy","12e",25,"남","china","nssf@google.co.kr");







drop table allergies;

CREATE TABLE allergies(
    id int NOT NULL AUTO_INCREMENT,
    algname varchar(200) NOT NULL,

    PRIMARY KEY (id)
);

INSERT INTO allergies(algname)
VALUES 
    ("egg"),
    ("milk"),
    ("buckwheat"),
    ("peanut"),
    ("soy bean"),
    ("wheat"),
    ("mackerel"),
    ("crab"),
    ("shrimp"),
    ("pork"),
    ("peach"),
    ("tomato"),
    ("sulfites"),
    ("walnut"),
    ("chicken"),
    ("beef"),
    ("shellfish"),
    ("mussel"),
    ("abalone"),
    ("oyster"),
    ("pine nut"),
    ("squid"),
    ("sesame"),
    ("almond");

drop table userAlgs;

CREATE TABLE userAlgs(
    id int NOT NULL AUTO_INCREMENT,
    algid int NOT NULL,
    uid int NOT NULL,
    PRIMARY KEY (id),
    FOREIGN KEY (algid) REFERENCES allergies(id),
    FOREIGN KEY (uid) REFERENCES users(id)
);


INSERT INTO userAlgs(uid,algid)
    values(1,1),
    (1,3),
    (1,2),
    (1,10),
    (1,7),
    (2,3),
    (2,1),
    (2,4),
    (2,6),
    (3,1),
    (3,2),
    (3,3),
    (4,1),
    (4,2),
    (4,5),
    (4,6),
    (4,7),
    (4,8);


-- uid가 2이고 algid가 3인 행 삭제
-- DELETE FROM userAlgs
-- WHERE uid = 2 AND algid IN (3, 4, 5);


drop table restaurant;
CREATE TABLE restaurant(
    id int NOT NULL AUTO_INCREMENT,
    uid varchar(30) NOT NULL,
    psword varchar(30) NOT NULL,
    rest_name varchar(30) NOT NULL,
    address varchar(100) NOT NULL,
    ceo_name varchar(30) NOT NULL,
    tel varchar(30) NOT NULL,
    img_url varchar(50),

    
    PRIMARY KEY (id)
);


INSERT INTO restaurant(uid,psword,rest_name,address,ceo_name,tel,img_url)
 values("rid","123","Yeon Tan Bulgogi","1, Maenamdong-gil, Heungeop-myeon, Wonju-si, Gangwon-do","kim","033-742-5878","Yeon-Tan-Bulgogi"),
       ("teol","123","TeolBone","16, Sedong-gil, Heungeop-myeon, Wonju-si, Gangwon-do","park","033-762-6786","teol-bone"),
       ("jeon","123","JeonSeonSeng","10-5, Sedong-gil, Heungeop-myeon, Wonju-si, Gangwon-do","choi","033-760-3242","jeonseonseng"),
       ("zzd","123","Cheongnyeonpocha","23, Sedong-gil, Heungeop-myeon, Wonju-si, Gangwon-do","jhon","033-760-7765","cheongnyeon"),
       ("qwe","123","Myeongga","20, Sedong-gil, Heungeop-myeon, Wonju-si, Gangwon-do","lee","033-764-1024","myeongga");



-- CREAT TABLE ingredients(
--     id int NOT NULL AUTO_INCREMENT,
--     igd_name varchar(30) NOT NULL
    
-- );

-- INSERT INTO ingredients()
--     values("fork"),
--     values("ganzang"),
--     values("gochuzang"),
--     values("daepha"),
--     values("chiken"),
--     values("yangpa")
--     values("egg"),
--     values("peanut"),
--     values("pepper");




-- CREATE TABLE ingdAlgs(
--     id int NOT NULL AUTO_INCREMENT,
--     igd_id int NOT NULL,
--     alg_id int NOT NULL,
--     PRIMARY KEY (id),
--     FOREIGN KEY (alg_id) REFERENCES allergies(id),
--     FOREIGN KEY (igd_id) REFERENCES users(id)
-- );


-- INSERT INTO ingdAlgs(igd_id,alg_id)
--     values(1,3),
--     (7,2),
--     (8,1),
--     (2,8);


drop table menu;



CREATE TABLE menu(
    id int NOT NULL AUTO_INCREMENT,
    rest_id int NOT NULL,
    menu_name varchar(100) NOT NULL,
    kor_name varchar(100) NOT NULL,
    roman_name varchar(100) NOT NULL,
    menu_price varchar(50) NOT NULL,
    img_url varchar(50) NOT NULL,
    menu_ing varchar(200) NOT NULL,
    PRIMARY KEY(id),
    FOREIGN KEY(rest_id) REFERENCES restaurant(id)
    
);


INSERT INTO menu(rest_id,menu_name, kor_name, roman_name, menu_price,img_url,menu_ing)
 values("1","Soy Sauce Bulgogi", "간장불고기","Ganjangbulgogi", "7,000","soy-sauce-bulgogi","pork, soy bean, egg, sesame, squid, leek, soy sauce, sugar, pepper, cooking wine, garlic, ginger"),
("1","Gochujang Bulgogi", "고추장불고기","Gochujangbulgogi", "7,000","gochujang-bulgogi", "pork, egg, sesame, squid, onion, carrot, leek, soy sauce, garlic, red pepper powder, red pepper paste"),
("1","Gochujang Chicken", "고추장치킨","Gochujangchikin", "7,500","gochujang-chicken","chicken, pork, egg, sesame, squid, onion, carrot, leek, soy sauce, garlic, red pepper powder, red pepper paste"),

("2","Grilled Marinated Mackerel", "고갈비구이","Gogalbigui", "10,000","gogalbigui","mackerel, sesame, soy bean, green onion, soy sauce, sugar, pepper, cooking wine, garlic, ginger, red pepper powder, red pepper paste"),
("2","Chicken Gizzards", "닭똥집","Dakttongjip", "9,000","dakttongjip", "chicken gizzard, sesame, milk, oyster, garlic, green chilli pepper, soju, pepper, oyster sauce"),
("2","Sundae", "순대","Sundae", "7,500","sundae","pork, sesame, green onion, red pepper, napa cabbage, glutinous rice"),

("3","Rice Pancake", "밥전","Babjeon", "6,000","pabjeon", "rice, egg, pork, crab, milk, wheat, soy bean, carrot, garlic, cabbage, green onion"),
("3","Shred Potato Pancake", "감자채전","Gamjachejeon", "6,000","gamjachejeon", "potato, egg, milk, crab, wheat, soy bean, sugar"),
("3","Kimchi Pancake", "김치전","Kimchijeon", "6,000","kimchijeon", "kimchi, egg, squid, shrimp, wheat, soy bean, garlic, pancake powder"),
("3","Seafood and Green Onin Pancake", "해물파전","Hemulpajeon", "9,000","hemulpajeon", "egg, squid, shrimp, wheat, soy bean, mussel, pancake powder, chives"),

("4", "Fried Boneless Chicken Plate", "통살플레이트","Tongsalpeulleiteu", "15,000", "tongsalpeulleiteu","chicken, potato, soy bean, milk, peanut, tomato, bean sprouts, parsley, garlic, sugar, salt, katsuobushi, mayonnaise"),
("4", "Stir-fried Beef Brisket with Mung Bean Sprouts", "차돌박이 숙주볶음","Chadolbagi sukjubokkeum", "13,000", "sukjubokkeum","beef, peanut, soy bean, peach, bean sprouts, red pepper oil, soy sauce, oyster sauce, garlic, pepper, sugar, chives"),
("4", "Korean-style Raw Beef for Freshman", "새내기 육회","Saenaegi yukoe", "13,000", "saenaegi-yukoe","beef, sesame, egg, salt, sugar, garlic, pear, plum, soy sauce, soy bean"),

("5", "Beef Loin and Sausage Jjigae", "우삽겹부대찌개","Usapgyeopbudaejjigae", "24,000", "usapgyeopbudaejjigae","beef, enoki mushroom, udon noodles, soy bean, rice cake, dumpling, kimchi, chives, mugwort"),
("5", "Whole Shrimp and Sausage Jjigae", "통새우부대찌개","Tongsaeubudaejjigae", "22,000", "tongsaeubudaejjigae","shrimp, dumpling, cheeze, green onion, mushroom, rice cake, soy bean, kimchi");




drop table menuAlgs;

CREATE TABLE menuAlgs(
    id int NOT NULL AUTO_INCREMENT,
    alg_id int NOT NULL,
    menu_id int NOT NULL,
    PRIMARY KEY (id),
    FOREIGN KEY (alg_id) REFERENCES allergies(id),
    FOREIGN KEY (menu_id) REFERENCES menu(id)
);


INSERT INTO menuAlgs(menu_id,alg_id) 
values
(1, 5),
(1, 10),
(1, 1),
(1, 23),
(1, 22),
(2, 10),
(2, 1),
(2, 23),
(2, 22),
(3, 15),
(3, 10),
(3, 1),
(3, 23),
(3, 22),
(4, 7),
(4, 5),
(4, 23),
(5, 15),
(5, 23),
(5, 2),
(5, 20),
(6, 10),
(6, 23),
(7, 1),
(7, 10),
(7, 8),
(7, 2),
(7, 6),
(7, 5),
(8, 1),
(8, 2),
(8, 8),
(8, 6),
(8, 5),
(9, 1),
(9, 2),
(9, 8),
(9, 6),
(9, 5),
(10, 1),
(10, 2),
(10, 8),
(10, 6),
(10, 5),
(10, 18),
(11, 15),
(11, 5),
(11, 2),
(11, 4),
(11, 12),
(12, 16),
(12, 4),
(12, 5),
(12, 11),
(12, 20),
(13, 16),
(13, 23),
(13, 1),
(13, 5),
(14, 16),
(14, 6),
(14, 10),
(14, 5),
(15, 2),
(15, 9),
(15, 10),
(15, 16),
(15, 5);






CREATE TABLE visithistory(
    id int NOT NULL AUTO_INCREMENT,
    uid varchar(30) NOT NULL,
    in_date datetime DEFAULT current_timestamp,

    PRIMARY KEY (id)
);

INSERT INTO visithistory(uid)
    values("lls");


CREATE TABLE igd(
    id int NOT NULL AUTO_INCREMENT,
    name varchar(200) NOT NULL,
    PRIMARY KEY (id)
);

INSERT INTO igd (name) values
    ('치즈떡'),('비빔오징어젓'),('하루의 열매 베리믹스 한입'),('하루의 열매 베리넛츠 한입'),('파채양념'),('볶음짜장소스'),('얼큰한육개장'),('시원한소고기해장국'),('진한돼지고기김치찌개'),('담백한버섯된장찌개'),('다시마양조간장'),('자연드림 우리밀고추장'),('두번달인알콩달콩양조간장'),('한입떡갈비'),('고기전'),('찹쌀고기단자'),('두툼 떡갈비'),('흑임자드레싱'),('파인요거트드레싱'),('양파드레싱'),('주부9단 슬라이스햄'),('프라임 살코기햄'),('주부9단 김밥햄'),('주부9단 옹기종기 베이컨'),('알래스칸특급 야채볼 어묵'),('알래스칸특급 우엉사각 어묵'),('알래스칸특급 도톰한사각어묵'),('알래스칸특급 풋콩어묵'),('알래스칸특급 우엉고추당근 어묵'),('알래스칸특급 채소사각어묵'),('알래스칸특급 두부야채 어묵'),('알래스칸특급 체다치즈롤'),('알래스칸특급 어묵전골'),('알래스칸 특급 양파어묵'),('알래스칸특급 매콤고추어묵'),('알래스칸특급 모둠탕어묵'),('알래스칸특급 풋콩 어묵'),('알래스칸특급직화구운어묵'),('유자드레싱'),('양파드레싱'),('키위드레싱'),('오케이쿡 치즈스틱'),('치즈스틱'),('콩으로 콩이가득 두부'),('콩으로 국산콩 두부반모'),('고소함이 쏘옥 인절미 치즈'),('고소함이 쏘옥 인절미 콩고물'),('굿프랜즈 한입떡갈비'),('등심돈까스 / 냉장'),('한입치킨까스'),('치킨너겟'),('노브랜드 떡갈비맛 고기완자'),('눈꽃등심돈까스'),('한턱쏘시지'),('다향오리 정육슬라이스'),('다향훈제오리600'),('1등급 허브갈릭 훈제슬라이스'),('열탄불고기 매콤한맛'),('열탄불고기'),('다향훈제오리200'),('다향훈제오리500'),('국산원료100%로 만든 된장'),('국산원료100%로 만든 고추장'),('매콤고등어조림'),('매콤갈치조림'),('통베이컨'),('베이컨 라이트'),('양념 LA소갈비 / 냉장'),('양념 누드 안심 닭갈비 / 냉장'),('돼지껍데기'),('포차통닭발'),('불닭'),('양념닭발'),('안동찜닭'),('맛있는 진미 춘장'),('우리쌀로만든 한우볶음고추장'),('진미 태양초 고추장'),('진미춘장 불맛'),('진미 양념이된 초고추장'),('청매실 태양초 찰고추장'),('청양초 매실 고추장'),('진미 태양초 골드 고추장'),('진미 고기전용 쌈장'),('태양초골드고추장'),('양념이된 초고추장'),('맛있는 양념쌈장'),('진미춘장'),('밀떡볶이'),('바삭바삭 미니까스'),('순등심돈까스 S'),('명가치즈등심돈까스'),('프라임치즈돈까스'),('순순살치킨까스'),('한줄돈까스'),('프라임피자돈까스'),('고구마치즈돈까스'),('명가등심돈까스'),('야채맛모듬어묵'),('오징어볼 어묵'),('홍단어묵'),('삼각당면어묵'),('해물네모어묵'),('요리평 어묵'),('땡초파전 어묵'),('야채말이 어묵'),('해물맛 모듬어묵'),('맛살말이'),('버섯어묵'),('알찬모듬어묵'),('옛날모듬어묵'),('땡초말이 어묵'),('야채찌짐이 어묵'),('오말이 어묵'),('특낙엽 어묵'),('매운맛모듬어묵'),('부 산 어 묵'),('신선한 버터우유식빵'),('만두연구소 왕교자'),('왕교자'),('육즙가득왕교자'),('육즙가득새우왕교자'),('정선 곤드레미니지짐만두'),('만두연구소 도토리전병'),('만두연구소 바삭촉촉 군만두'),('만두연구소 생돈육 왕만두'),('우리밀 김치 손만두'),('왕만두'),('찰떡만두'),('물만두'),('한면원 생 칼국수'),('옛날 수연소면'),('카레라이스 쌀면'),('먹태'),('몽고간장 1급'),('몽고간장 진골드'),('몽고간장 진'),('성심진간장'),('백설 핫케익믹스'),('자연재료튀김가루'),('이츠웰 부침가루'),('우리밀 부침가루'),('백설 우리밀 통밀 영양가득 곱게빻은 밀가루'),('치킨튀김가루'),('토마토케찹'),('자연드림사우전아일랜드드레싱'),('자연드림 상큼한 토마토케찹'),('요거트드레싱 골드'),('키위드레싱 골드'),('이츠웰골드마요네즈'),('딸기드레싱'),('요거트드레싱'),('케이준샐러드드레싱'),('키위드레싱'),('우아한키위드레싱'),('우아한오리엔탈드레싱'),('마요네즈'),('비빔장'),('스위트머스타드드레싱'),('들깨드레싱'),('참깨&흑임자드레싱'),('프리미엄오리엔탈드레싱'),('클래식시저드레싱'),('허니머스타드드레싱'),('아몬드&호두드레싱'),('남대문갈치조림양념'),('sias올리브유 오리엔탈 드레싱'),('무교동오징어낙지볶음양념'),('올리브유발사믹드레싱'),('시아스고구마무스골드'),('오리엔탈드레싱'),('아임햄'),('라이어너햄'),('선진카슬러햄'),('선진파스트라미'),('선진등심바베큐햄'),('런천미트'),('리챔 오리지널'),('동원 오븐&통그릴 델리햄'),('메밀가루'),('골드삼포고기손만두'),('고기손만두'),('옛날 잡채왕교자만두'),('옛날왕교자만두'),('맛있는물만두'),('감자떡김치만두'),('감자떡만두'),('옛날왕만두'),('리 김밥용지단'),('셰프의국수전계란지단'),('장푸드 신선한 쌈장'),('오쉐프 초고추장'),('이츠웰 태양초 고추장'),('양념쌈장골드'),('참진한 진간장'),('맛있게 깔끔한 진간장'),('맛있게 매콤한 태양초 고추장'),('베스트코 쌈장'),('베스트코 회 초고추장'),('청정원 양념 초고추장'),('청정원재래식콩알된장'),('숯불향고기소스'),('비빔국수장'),('골뱅이무침소스'),('우리밀로만든카레소스'),('우리밀춘장으로만든짜장소스'),('다섯식구 비빔양념장'),('다섯식구 메밀육수'),('고구마무스'),('체다슈레드치즈'),('라면 쏘옥 치즈'),('궁중 너비아니'),('한솔돈까스'),('치즈돈까스'),('백설남해전복굴소스'),('100% 국산고추장'),('쇠고기볶음고추장'),('백설 남해 굴소스'),('백설 남해 매운굴소스'),('알찬고추장'),('홈스타일짜장'),('제주돼지완자'),('프라임돈까스'),('미니돈까스'),('동원동그랑땡'),('프리미엄돈까스'),('금돼지식당햄'),('프라임치즈돈까스'),('프라임가슴살치킨까스'),('오뚜기 닭근위마늘볶음'),('고향깔끔한물만두'),('백설김치손만두'),('납작군만두'),('바삭군만두'),('교자만두'),('교자만두'),('3분쇠고기간짜장'),('스테이크소스'),('돈까스소스'),('비빔장'),('오뚜기 데리야끼소스'),('1/2하프마요'),('1000 아일랜드 드레싱'),('3분하이라이스소스'),('오뚜기백세카레(순한맛)'),('3분 사천짜장'),('사천짜장'),('오뚜기짜장'),('대림선 속이꽉찬 교자만두'),('엄선된 원료로 정성들여 만든 고기손만두'),('대림선 군만두'),('대림선 철판사각잡채군만두'),('대림선 김치손만두'),('대림선 고기손만두'),('대림선 물만두'),('고향 깔끔한 물만두'),('메밀지짐만두'),('청고추만두'),('평양왕만두'),('꽉 채운 물만두'),('명품평양왕만두'),('선진포크 야채군만두'),('선진포크왕만두'),('선진포크 고기손만두'),('모듬어묵'),('채소어묵바'),('네모어묵'),('주부9단김밥용 세절햄'),('주부9단비엔나소시지'),('주부9단 순살햄'),('주부9단 옹기종기베이컨'),('주부9단프랑크소시지'),('주부9단 갈비맛바'),('주부9단 김밥용세절햄'),('주부9단 뚝심'),('주부9단 로스구이'),('주부9단 김밥햄'),('프라임 순살햄'),('목우촌 흑마늘햄'),('주부9단 프랑크소시지'),('프라임리얼사각햄'),('목우촌 두레햄'),('바베큐사태햄'),('안심햄'),('프라임 불에구운떡갈비맛햄'),('주부9단 불고기햄'),('주부9단 3(삼)3(삼)1(한)햄'),('주부9단순살햄'),('알뜨레불고기스모크세절햄'),('본레스햄'),('목우촌갈비'),('로스트햄'),('등심햄'),('제대로만든 불에 구운김밥햄'),('주부9단김밥햄(수출품)'),('목우촌주부9단살코기햄'),('주부9단 살코기햄'),('주부9단 김밥햄'),('이마트프리미엄 등심햄'),('이마트프리미엄 안심햄'),('주부9단불고기햄'),('주부9단3(삼)3(삼)1(한)햄'),('알뜨레 불고기 스모크햄'),('양파와 마늘로 맛있게 재운 스모크햄'),('주부9단 김밥햄'),('아워홈 순살햄'),('부대찌개모듬햄'),('본레스햄'),('불고기맛햄'),('바삭부침가루'),('찰보리부침가루'),('자연재료 부침가루'),('이츠웰부침가루'),('속찬김치손만두'),('롯데햄 베이컨'),('롯데햄 슬라이스햄'),('닭가슴살 슬라이스햄'),('엔네이처 샌드위치햄'),('슬라이스햄'),('무항생제 돼지고기로 만든 순햄'),('마늘햄'),('옛날칼국수'),('옛날중면'),('동원 New 해물모듬완자'),('동원 해물버섯완자'),('DONGWON 새참잡채군만두'),('개성제주돼지왕만두'),('개성백김치물만두'),('개성왕교자만두'),('해물표고버섯완자'),('개성교자만두김치'),('개성물만두백김치'),('개성교자만두'),('알찬만두'),('개성찰감자만두'),('조이락교자만두'),('쇠고기볶음장'),('양념초장'),('비비고(bibiog) 군만두'),('고추깻잎군만두'),('더욱 맛있어진 뉴백설군만두'),('보리쌈장'),('양념듬뿍쌈장'),('명품집된장'),('시골된장'),('8가지국산양념쌈장'),('사계절쌈장골드'),('고기전용쌈장'),('사계절쌈장'),('재래식된장'),('맛있는 청국장'),('요거트드레싱'),('아몬드호두드레싱'),('참깨드레싱'),('CJ발사믹드레싱'),('CJ시저드레싱'),('허니머스터드드레싱'),('클래식오리엔탈드레싱'),('이탈리안드레싱'),('오리엔탈드레싱'),('크리미양파드레싱'),('사우전아일랜드드레싱-FS'),('쉐프원키위드레싱'),('쉐프원요거트드레싱'),('쉐프원케이준드레싱'),('이츠웰국간장'),('이츠웰진간장'),('양지뜰진간장'),('다시다요리수 해물스톡'),('다시다요리수 치킨스톡'),('다시다쇠고기'),('다시다골드쇠고기'),('다시다쇠고기골드전문식당용'),('찬마루 들기름 볶음김치'),('옛날국수 중면'),('옛날국수 소면'),('옛날칼국수'),('유부초밥박사Ⅲ'),('유부나라슬라이스'),('옹가네진간장'),('재래된장'),('신송된장'),('신송초고추장'),('옛맛그대로찹쌀고추장'),('짠맛을 줄인 건강한 재래된장'),('짠맛을 줄인 건강한 고추장'),('정성가득춘장'),('정성가득 양조간장'),('정성가득 진간장'),('정성가득 쌈장'),('정성가득 초고추장'),('정성가득 된장'),('정성가득 고추장'),('짠맛을 줄인 건강한 신송 양조간장'),('조이블재래된장'),('우리쌀우리보리고추장'),('신송쌈장'),('신송국간장'),('자맛메밀막국수건더기'),('자맛육개장칼국수건더기'),('우렁쌈장'),('고소쌈장'),('생냉면'),('칠리토마토스파게티'),('사각어묵'),('스노우크랩 퓨어'),('스노우크랩'),('요리 부산어묵 사각'),('종합어묵'),('맛있는 종합어묵'),('김밥 愛(애) 쏘옥'),('요리가 간편한 어묵'),('맛종합어묵'),('야채시대 김밥어묵'),('국탕용 종합꼬치'),('조기어묵'),('부산어묵 백두장사'),('부산어묵 마당놀이'),('몽고간장 순'),('몽고간장 송표골드'),('몽고송표ORIGINAL간장'),('몽고간장 생'),('몽고간장 메주'),('더(The) 건강한 어묵 클래식 사각'),('안심부산어묵 종합'),('오뎅나베용 더(The) 건강한 어묵'),('안심부산어묵'),('삼호요리어묵 야채사각'),('씨제이 씨푸드 삼호부산어묵'),('삼호요리어묵 김밥어묵'),('삼호부산어묵떡볶이용 사각'),('삼호부산어묵부추'),('삼호요리어묵 국·탕용 종합Ⅲ'),('삼호요리어묵 국·탕용 종합I'),('신 비비고물만두'),('비비고 새우왕교자'),('신 비비고 김치왕교자'),('비비고 청양고추 찐만두'),('신 비비고 왕교자'),('비비고찐만두'),('샘표 향신간장 국, 전골용 소스'),('샘표 국시장국 메밀소바소스'),('샘표 향신간장 조림,찜,볶음용 소스'),('유기농 양조간장'),('샘표 국시장국 멸치다시마 국물'),('참숯으로 두번거른 깔끔한 양조간장'),('유기농 자연콩 간장'),('진간장 에스(진간장 S)'),('진강장 금에스(진간장 금S)'),('국간장'),('조림간장'),('연두 청양초'),('맛간장 국찌개용'),('샘표 국시장국 가쓰오국물'),('진간장 금에프3(진간장 금F3)'),('국산콩간장 프리미엄(국산콩간장 PREMIUM)'),('애터미착한햄'),('순살슬라이스햄'),('카나디언햄'),('튀김가루'),('치킨튀김가루3호'),('핫도그가루2호'),('고급전용분1호'),('곰표고급제면용1호'),('곰표고급제면용(호주산밀100%)'),('코끼리(피자용)'),('코끼리(빵용)'),('곰표 강력제면용'),('곰표 고급생면용'),('곰표찰진햇밀가루'),('곰표밀가루'),('옛날칼국수'),('옛날국수(중면)'),('옛날국수(소면)'),('오복양조 회간장'),('오복양조(왕표)'),('오복간장(진간장)'),('오복간장(금표)'),('양반볶음김치'),('스윗콘 드레싱'),('흑임자&갈릭드레싱'),('백설 제일제면소 중면'),('백설 제일제면소 메밀소바'),('우리밀국수 소면'),('소면500g'),('대림선 구운마늘햄'),('김밥용햄'),('숯불구이맛 김밥햄'),('빅불고기햄'),('와후카레 중간맛'),('와후카레 매운맛'),('와후카레(순한맛)');

CREATE TABLE igdAlgs(
    id int NOT NULL AUTO_INCREMENT,
    alg_id int NOT NULL,
    igd_id int NOT NULL,
    PRIMARY KEY (id),
    FOREIGN KEY (alg_id) REFERENCES allergies(id),
    FOREIGN KEY (igd_id) REFERENCES igd(id)
);

INSERT INTO igdAlgs (igd_id, alg_id) values
    (1, 2),(1, 5),(2, 22),(3, 2),(3, 5),(3, 14),(3, 6),(4, 2),(4, 5),(4, 14),(4, 6),(5, 2),(5, 5),(5, 6),(5, 16),(5, 17),(5, 20),(6, 10),(6, 5),(6, 6),(7, 5),(7, 6),(7, 16),(7, 17),(7, 20),(8, 5),(8, 6),(8, 16),(8, 17),(8, 20),(9, 5),(9, 6),(9, 9),(9, 10),(9, 16),(9, 17),(9, 20),(10, 5),(10, 6),(10, 16),(10, 17),(10, 20),(11, 5),(11, 6),(12, 6),(13, 5),(13, 6),(14, 16),(14, 10),(14, 5),(14, 6),(15, 16),(15, 10),(15, 5),(16, 2),(16, 5),(16, 6),(16, 10),(16, 16),(17, 16),(17, 10),(17, 5),(17, 6),(18, 16),(18, 1),(18, 5),(18, 6),(19, 1),(19, 5),(20, 1),(20, 5),(21, 10),(21, 2),(21, 5),(21, 6),(22, 2),(22, 5),(22, 6),(22, 10),(22, 12),(22, 16),(23, 16),(23, 10),(23, 5),(24, 2),(24, 5),(24, 6),(24, 10),(24, 12),(24, 16),(25, 1),(25, 20),(25, 5),(25, 17),(26, 1),(26, 20),(26, 5),(26, 17),(27, 17),(27, 20),(27, 5),(27, 6),(28, 1),(28, 5),(28, 6),(28, 17),(28, 20),(29, 17),(29, 20),(29, 5),(29, 6),(30, 17),(30, 20),(30, 5),(30, 6),(31, 1),(31, 20),(31, 5),(31, 6),(32, 1),(32, 2),(32, 5),(32, 6),(33, 1),(33, 5),(33, 6),(33, 15),(33, 17),(33, 20),(34, 1),(34, 5),(34, 6),(34, 17),(34, 20),(35, 1),(35, 5),(35, 6),(35, 17),(35, 20),(36, 1),(36, 5),(36, 6),(36, 15),(36, 17),(36, 20),(37, 1),(37, 5),(37, 6),(37, 17),(37, 20),(38, 1),(38, 5),(38, 6),(39, 2),(40, 16),(40, 1),(40, 5),(41, 16),(41, 1),(41, 2),(41, 5),(42, 1),(42, 2),(42, 5),(42, 6),(43, 1),(43, 2),(43, 5),(43, 6),(44, 5),(45, 5),(46, 2),(47, 5),(48, 2),(48, 5),(48, 6),(48, 10),(48, 15),(48, 16),(49, 10),(49, 2),(49, 5),(49, 6),(50, 16),(50, 5),(50, 6),(50, 15),(51, 1),(51, 2),(51, 5),(51, 6),(51, 15),(51, 16),(52, 1),(52, 5),(52, 6),(52, 10),(52, 16),(53, 1),(53, 2),(53, 6),(53, 10),(53, 16),(54, 10),(54, 5),(55, 2),(55, 5),(55, 6),(56, 16),(56, 2),(56, 5),(56, 6),(57, 2),(57, 5),(57, 6),(58, 5),(58, 6),(59, 5),(59, 6),(60, 16),(60, 2),(60, 5),(60, 6),(61, 16),(61, 2),(61, 5),(61, 6),(62, 5),(63, 5),(63, 6),(64, 2),(64, 5),(64, 6),(64, 7),(64, 16),(64, 17),(65, 2),(65, 5),(65, 6),(65, 16),(65, 17),(66, 10),(67, 10),(68, 2),(68, 5),(68, 6),(68, 12),(68, 15),(69, 2),(69, 5),(69, 6),(69, 12),(69, 15),(70, 10),(70, 5),(70, 6),(71, 5),(71, 6),(72, 5),(72, 6),(72, 15),(73, 5),(73, 6),(73, 15),(74, 4),(74, 5),(74, 6),(75, 5),(75, 6),(76, 16),(77, 5),(77, 6),(78, 16),(78, 17),(78, 5),(78, 6),(79, 5),(79, 6),(80, 5),(80, 6),(81, 5),(81, 6),(82, 6),(83, 5),(83, 6),(84, 6),(85, 5),(85, 6),(86, 5),(86, 6),(87, 5),(87, 6),(88, 5),(88, 6),(89, 10),(89, 6),(90, 10),(90, 2),(90, 5),(90, 6),(91, 10),(91, 2),(91, 5),(91, 6),(92, 10),(92, 2),(92, 5),(92, 6),(93, 2),(93, 5),(93, 6),(93, 15),(93, 16),(94, 10),(94, 5),(94, 6),(95, 2),(95, 5),(95, 6),(95, 10),(95, 12),(95, 15),(95, 16),(95, 17),(95, 20),(96, 1),(96, 2),(96, 5),(96, 6),(96, 10),(96, 16),(97, 10),(97, 2),(97, 5),(97, 6),(98, 1),(98, 2),(98, 5),(98, 6),(98, 8),(98, 12),(98, 15),(98, 16),(99, 8),(99, 5),(99, 22),(99, 6),(100, 8),(100, 5),(100, 6),(101, 8),(101, 5),(101, 6),(102, 5),(102, 6),(102, 8),(102, 9),(102, 22),(103, 8),(103, 5),(103, 6),(104, 8),(104, 5),(104, 6),(105, 8),(105, 16),(105, 5),(105, 6),(106, 1),(106, 5),(106, 6),(106, 8),(106, 9),(106, 16),(106, 22),(107, 8),(107, 1),(107, 5),(107, 6),(108, 5),(108, 6),(109, 1),(109, 2),(109, 5),(109, 6),(109, 8),(109, 12),(109, 16),(109, 22),(110, 1),(110, 2),(110, 5),(110, 6),(110, 8),(110, 9),(110, 12),(110, 16),(110, 22),(111, 8),(111, 5),(111, 6),(112, 8),(112, 5),(112, 6),(113, 8),(113, 16),(113, 5),(113, 6),(114, 8),(114, 16),(114, 5),(114, 6),(115, 2),(115, 5),(115, 6),(115, 8),(115, 10),(115, 15),(115, 16),(116, 5),(116, 6),(117, 2),(117, 5),(117, 6),(118, 16),(118, 10),(118, 5),(118, 6),(119, 2),(119, 5),(119, 6),(119, 10),(119, 15),(119, 16),(120, 1),(120, 2),(120, 5),(120, 6),(120, 9),(120, 10),(120, 15),(120, 16),(120, 17),(120, 20),(121, 1),(121, 2),(121, 5),(121, 6),(121, 9),(121, 10),(121, 15),(121, 16),(121, 17),(121, 20),(122, 1),(122, 5),(122, 6),(122, 10),(122, 16),(123, 5),(123, 6),(123, 9),(123, 10),(123, 16),(124, 1),(124, 2),(124, 5),(124, 6),(124, 10),(124, 16),(125, 1),(125, 2),(125, 5),(125, 6),(125, 10),(125, 16),(126, 5),(126, 6),(126, 9),(126, 10),(126, 16),(127, 1),(127, 2),(127, 5),(127, 6),(127, 10),(127, 16),(127, 17),(127, 20),(128, 2),(128, 5),(128, 6),(128, 10),(128, 16),(129, 1),(129, 5),(129, 6),(129, 10),(129, 16),(130, 6),(131, 6),(132, 1),(132, 2),(132, 4),(132, 5),(132, 6),(132, 10),(132, 12),(132, 15),(132, 16),(132, 17),(133, 16),(133, 5),(133, 6),(134, 5),(134, 6),(135, 5),(135, 6),(136, 5),(136, 6),(137, 5),(137, 6),(138, 2),(138, 5),(138, 6),(139, 6),(140, 6),(141, 6),(142, 6),(143, 6),(144, 12),(144, 5),(145, 1),(145, 12),(145, 5),(146, 12),(147, 1),(147, 2),(147, 5),(148, 1),(148, 5),(149, 1),(149, 5),(150, 5),(151, 1),(151, 2),(151, 5),(152, 1),(152, 2),(152, 5),(152, 6),(152, 10),(153, 6),(154, 1),(154, 2),(154, 5),(155, 5),(155, 6),(156, 16),(156, 1),(156, 5),(157, 5),(157, 6),(158, 1),(159, 1),(159, 4),(159, 5),(160, 1),(160, 5),(160, 6),(161, 5),(161, 6),(162, 1),(162, 2),(162, 5),(162, 6),(163, 1),(163, 5),(163, 6),(164, 1),(164, 2),(164, 5),(164, 6),(164, 14),(165, 5),(165, 6),(166, 5),(166, 6),(167, 5),(167, 6),(168, 6),(169, 1),(169, 2),(169, 5),(170, 5),(170, 6),(171, 1),(171, 2),(171, 5),(171, 6),(171, 10),(171, 15),(171, 16),(172, 10),(172, 5),(173, 10),(174, 10),(174, 5),(175, 10),(175, 5),(176, 10),(176, 6),(176, 15),(177, 10),(177, 5),(178, 2),(178, 5),(178, 6),(178, 10),(178, 16),(179, 3),(179, 6),(180, 5),(180, 6),(180, 10),(180, 15),(180, 16),(180, 17),(180, 20),(181, 5),(181, 6),(181, 10),(181, 17),(181, 20),(182, 1),(182, 5),(182, 6),(182, 10),(182, 16),(182, 17),(182, 20),(183, 1),(183, 2),(183, 5),(183, 6),(183, 10),(183, 16),(183, 17),(183, 20),(184, 10),(184, 5),(184, 6),(185, 9),(185, 10),(185, 5),(185, 6),(186, 2),(186, 5),(186, 6),(186, 10),(186, 16),(187, 1),(187, 2),(187, 5),(187, 6),(187, 10),(187, 16),(188, 1),(188, 5),(188, 6),(188, 12),(188, 16),(189, 1),(189, 5),(189, 6),(189, 12),(189, 16),(190, 5),(190, 6),(191, 6),(192, 5),(192, 6),(193, 5),(193, 6),(194, 5),(194, 6),(195, 5),(195, 6),(196, 5),(196, 6),(197, 5),(197, 6),(198, 6),(199, 6),(200, 5),(200, 6),(201, 5),(201, 6),(201, 10),(201, 12),(201, 16),(202, 16),(202, 2),(202, 5),(202, 6),(203, 16),(203, 12),(203, 5),(203, 6),(204, 16),(204, 10),(204, 5),(204, 6),(205, 16),(205, 10),(205, 5),(205, 6),(206, 6),(207, 5),(207, 6),(208, 16),(208, 1),(208, 5),(209, 2),(210, 2),(211, 1),(211, 5),(211, 6),(212, 10),(212, 5),(212, 6),(213, 10),(213, 2),(213, 5),(213, 6),(214, 5),(214, 6),(214, 16),(214, 17),(214, 19),(214, 20),(215, 5),(215, 6),(216, 16),(216, 5),(216, 6),(217, 5),(217, 6),(217, 16),(217, 17),(217, 20),(218, 17),(218, 20),(218, 5),(218, 6),(219, 5),(219, 6),(220, 2),(220, 5),(220, 6),(220, 10),(220, 16),(221, 1),(221, 2),(221, 5),(221, 6),(221, 10),(221, 16),(221, 17),(222, 1),(222, 2),(222, 5),(222, 6),(222, 8),(222, 10),(222, 12),(222, 17),(222, 20),(223, 1),(223, 5),(223, 6),(223, 10),(223, 15),(223, 16),(224, 1),(224, 2),(224, 5),(224, 6),(224, 10),(224, 16),(224, 17),(225, 1),(225, 5),(225, 6),(225, 10),(225, 15),(226, 10),(226, 5),(227, 10),(227, 2),(227, 5),(227, 6),(228, 5),(228, 6),(228, 15),(229, 6),(229, 15),(230, 16),(230, 10),(230, 5),(230, 6),(231, 16),(231, 10),(231, 5),(231, 6),(232, 5),(232, 6),(232, 10),(232, 17),(232, 20),(233, 1),(233, 2),(233, 5),(233, 6),(233, 10),(233, 16),(234, 1),(234, 2),(234, 5),(234, 6),(234, 10),(234, 16),(235, 1),(235, 2),(235, 5),(235, 6),(235, 10),(235, 16),(236, 1),(236, 5),(236, 6),(236, 10),(236, 15),(236, 16),(236, 17),(236, 20),(237, 16),(237, 12),(237, 5),(238, 16),(238, 12),(238, 5),(239, 16),(239, 5),(239, 6),(240, 5),(240, 6),(240, 15),(240, 17),(240, 20),(241, 1),(241, 5),(241, 16),(241, 17),(241, 20),(242, 1),(242, 5),(242, 6),(242, 12),(242, 16),(243, 2),(243, 5),(243, 6),(243, 12),(243, 15),(243, 16),(243, 17),(243, 20),(244, 2),(244, 5),(244, 6),(244, 12),(244, 15),(244, 16),(244, 17),(244, 20),(245, 1),(245, 2),(245, 5),(245, 6),(245, 9),(245, 10),(245, 15),(245, 16),(245, 17),(245, 18),(245, 20),(245, 22),(246, 1),(246, 2),(246, 5),(246, 6),(246, 9),(246, 10),(246, 15),(246, 16),(246, 17),(246, 18),(246, 20),(246, 22),(247, 2),(247, 5),(247, 6),(247, 10),(247, 15),(247, 16),(248, 2),(248, 5),(248, 6),(248, 10),(248, 16),(249, 2),(249, 5),(249, 6),(249, 10),(249, 15),(249, 16),(249, 17),(250, 1),(250, 2),(250, 5),(250, 6),(250, 10),(251, 2),(251, 5),(251, 6),(251, 10),(251, 15),(251, 16),(251, 17),(252, 10),(252, 2),(252, 5),(252, 6),(253, 2),(253, 5),(253, 6),(253, 10),(253, 15),(253, 16),(253, 17),(254, 1),(254, 5),(254, 6),(254, 10),(254, 16),(255, 16),(255, 10),(255, 5),(255, 6),(256, 3),(256, 5),(256, 6),(256, 9),(256, 10),(257, 1),(257, 5),(257, 6),(257, 10),(257, 16),(258, 1),(258, 5),(258, 6),(258, 10),(258, 16),(258, 17),(258, 20),(259, 16),(259, 10),(259, 5),(259, 6),(260, 1),(260, 5),(260, 6),(260, 10),(260, 16),(261, 1),(261, 5),(261, 6),(261, 10),(261, 16),(261, 17),(261, 20),(262, 1),(262, 5),(262, 6),(262, 10),(262, 16),(263, 1),(263, 5),(263, 6),(263, 10),(263, 15),(263, 16),(264, 8),(264, 17),(264, 20),(265, 8),(265, 1),(265, 20),(265, 17),(266, 8),(266, 17),(266, 20),(267, 1),(267, 5),(267, 6),(267, 10),(267, 12),(267, 16),(268, 10),(268, 5),(269, 10),(269, 2),(269, 5),(270, 2),(270, 5),(270, 6),(270, 10),(270, 12),(271, 10),(271, 2),(271, 5),(272, 10),(272, 2),(272, 5),(272, 6),(273, 1),(273, 5),(273, 6),(273, 10),(273, 12),(273, 16),(274, 2),(274, 5),(274, 6),(274, 10),(274, 12),(274, 16),(275, 10),(275, 5),(276, 16),(276, 10),(276, 5),(277, 10),(277, 2),(277, 5),(277, 6),(278, 5),(278, 6),(278, 10),(278, 12),(278, 16),(279, 10),(279, 2),(279, 5),(280, 10),(280, 2),(280, 5),(280, 6),(281, 10),(281, 2),(281, 5),(281, 6),(282, 2),(282, 5),(282, 6),(282, 10),(282, 16),(283, 16),(283, 10),(283, 5),(283, 6),(284, 2),(284, 5),(284, 6),(284, 10),(284, 12),(284, 16),(285, 10),(285, 2),(285, 5),(285, 6),(286, 2),(286, 5),(286, 6),(286, 10),(286, 12),(287, 10),(287, 2),(287, 5),(288, 1),(288, 10),(288, 5),(289, 10),(289, 2),(289, 5),(290, 10),(291, 10),(291, 5),(292, 10),(292, 5),(293, 10),(293, 2),(293, 5),(294, 10),(294, 2),(294, 5),(295, 10),(295, 12),(295, 5),(295, 6),(296, 5),(296, 6),(296, 10),(296, 12),(296, 16),(297, 10),(297, 2),(297, 5),(298, 10),(298, 5),(299, 5),(299, 6),(299, 10),(299, 12),(299, 16),(300, 10),(300, 2),(300, 5),(300, 6),(301, 2),(301, 5),(301, 6),(301, 10),(301, 12),(302, 1),(302, 10),(302, 5),(303, 1),(303, 2),(303, 5),(303, 6),(303, 10),(303, 15),(304, 10),(304, 2),(304, 5),(305, 5),(305, 6),(305, 10),(305, 12),(305, 16),(306, 1),(306, 2),(306, 5),(306, 6),(306, 10),(306, 17),(306, 20),(307, 1),(307, 10),(307, 2),(307, 5),(308, 1),(308, 10),(308, 2),(308, 5),(309, 16),(309, 2),(309, 5),(309, 6),(310, 6),(311, 6),(312, 6),(313, 10),(313, 5),(313, 6),(314, 1),(314, 10),(314, 2),(314, 5),(315, 10),(315, 2),(315, 5),(315, 6),(316, 16),(316, 5),(316, 6),(316, 15),(317, 16),(317, 10),(317, 2),(317, 5),(318, 2),(318, 5),(318, 6),(318, 10),(318, 12),(318, 16),(319, 10),(319, 5),(319, 6),(320, 1),(320, 2),(320, 5),(320, 6),(320, 10),(320, 15),(320, 16),(321, 6),(322, 6),(323, 5),(323, 22),(323, 6),(324, 1),(324, 5),(324, 6),(324, 9),(324, 22),(325, 1),(325, 10),(325, 5),(325, 6),(326, 1),(326, 2),(326, 5),(326, 6),(326, 10),(326, 16),(327, 1),(327, 10),(327, 5),(327, 6),(328, 1),(328, 2),(328, 5),(328, 6),(328, 10),(328, 16),(328, 17),(328, 20),(329, 1),(329, 2),(329, 5),(329, 6),(329, 8),(329, 17),(329, 18),(329, 19),(329, 20),(329, 22),(330, 10),(330, 5),(330, 6),(331, 1),(331, 10),(331, 5),(331, 6),(332, 1),(332, 2),(332, 5),(332, 6),(332, 10),(332, 16),(333, 10),(333, 5),(333, 6),(334, 1),(334, 2),(334, 5),(334, 6),(334, 8),(334, 10),(334, 16),(334, 17),(334, 20),(335, 1),(335, 2),(335, 5),(335, 6),(335, 10),(336, 16),(336, 5),(336, 6),(337, 6),(338, 5),(338, 6),(338, 10),(338, 16),(338, 17),(338, 20),(339, 10),(339, 5),(339, 6),(340, 2),(340, 5),(340, 6),(340, 10),(340, 16),(341, 5),(341, 6),(342, 5),(342, 6),(343, 5),(344, 5),(344, 6),(345, 5),(345, 6),(346, 5),(346, 6),(347, 5),(347, 6),(348, 5),(348, 6),(349, 5),(349, 6),(350, 5),(350, 6),(350, 16),(350, 17),(350, 18),(351, 16),(351, 1),(351, 2),(351, 5),(352, 1),(352, 2),(352, 4),(352, 5),(352, 13),(352, 14),(352, 16),(353, 1),(353, 5),(353, 6),(354, 13),(355, 16),(355, 1),(355, 2),(355, 5),(356, 16),(356, 1),(356, 5),(357, 5),(357, 6),(358, 13),(359, 13),(359, 5),(359, 6),(360, 1),(360, 2),(360, 5),(361, 1),(361, 2),(361, 12),(361, 5),(362, 1),(362, 5),(363, 1),(363, 2),(363, 5),(364, 1),(364, 5),(365, 5),(365, 6),(366, 5),(366, 6),(367, 5),(367, 6),(368, 5),(368, 6),(368, 9),(368, 17),(368, 20),(369, 1),(369, 6),(369, 15),(370, 16),(370, 2),(370, 5),(370, 6),(371, 2),(371, 5),(371, 6),(371, 15),(371, 16),(371, 17),(372, 2),(372, 5),(372, 6),(372, 15),(372, 16),(372, 17),(373, 6),(374, 6),(375, 6),(376, 6),(377, 1),(377, 5),(377, 6),(378, 5),(379, 5),(379, 6),(380, 5),(380, 6),(381, 5),(381, 6),(382, 6),(383, 5),(384, 5),(384, 6),(385, 5),(385, 6),(386, 5),(386, 6),(387, 5),(387, 6),(388, 5),(388, 6),(389, 5),(389, 6),(390, 5),(390, 6),(391, 5),(391, 6),(392, 6),(393, 5),(393, 6),(394, 5),(394, 6),(395, 5),(396, 5),(396, 6),(397, 5),(397, 6),(398, 3),(398, 5),(398, 6),(399, 5),(399, 6),(399, 16),(399, 17),(399, 20),(400, 9),(400, 5),(400, 6),(401, 4),(401, 5),(401, 6),(402, 3),(402, 6),(403, 2),(403, 5),(403, 6),(403, 10),(403, 12),(403, 15),(404, 6),(405, 8),(405, 1),(405, 2),(405, 5),(406, 1),(406, 2),(406, 5),(406, 8),(406, 12),(407, 5),(407, 6),(408, 8),(408, 16),(408, 5),(408, 6),(409, 8),(409, 16),(409, 5),(409, 6),(410, 1),(410, 2),(410, 5),(410, 6),(410, 9),(410, 12),(410, 16),(410, 17),(410, 20),(411, 5),(411, 6),(412, 8),(412, 16),(412, 5),(412, 6),(413, 5),(413, 6),(414, 8),(414, 16),(414, 5),(414, 6),(415, 5),(415, 6),(416, 5),(416, 6),(417, 5),(417, 6),(418, 5),(418, 6),(419, 5),(419, 6),(420, 5),(420, 6),(421, 5),(421, 6),(422, 5),(422, 6),(423, 9),(423, 2),(423, 5),(423, 6),(424, 5),(424, 6),(425, 1),(425, 2),(425, 5),(425, 6),(425, 9),(426, 5),(426, 6),(427, 5),(427, 6),(428, 5),(428, 6),(429, 5),(429, 6),(430, 5),(430, 6),(431, 5),(431, 6),(432, 5),(432, 6),(433, 5),(433, 6),(434, 5),(434, 6),(434, 10),(434, 16),(434, 17),(434, 20),(435, 9),(435, 10),(435, 5),(435, 6),(436, 5),(436, 6),(436, 10),(436, 16),(436, 17),(436, 20),(437, 10),(437, 5),(437, 6),(438, 5),(438, 6),(438, 10),(438, 16),(438, 17),(438, 20),(439, 5),(439, 6),(439, 10),(439, 16),(439, 17),(439, 20),(440, 5),(440, 6),(440, 8),(440, 9),(440, 17),(440, 18),(441, 5),(441, 6),(442, 16),(442, 5),(442, 6),(443, 5),(443, 6),(444, 5),(444, 6),(445, 5),(445, 6),(446, 5),(446, 6),(447, 5),(447, 6),(448, 5),(448, 6),(449, 5),(449, 6),(450, 5),(450, 6),(451, 5),(452, 5),(452, 8),(452, 9),(452, 17),(452, 18),(452, 20),(452, 22),(453, 9),(453, 5),(453, 6),(454, 5),(454, 6),(455, 5),(455, 6),(456, 16),(456, 10),(456, 5),(457, 16),(457, 10),(457, 5),(457, 6),(458, 10),(458, 5),(459, 6),(460, 5),(460, 6),(461, 6),(462, 6),(463, 6),(464, 6),(465, 6),(466, 6),(467, 6),(468, 6),(469, 6),(470, 6),(471, 6),(472, 6),(473, 6),(474, 5),(474, 6),(475, 5),(475, 6),(476, 5),(476, 6),(477, 5),(477, 6),(478, 2),(479, 1),(479, 2),(479, 5),(480, 1),(480, 2),(480, 5),(480, 6),(480, 17),(480, 20),(481, 6),(482, 3),(482, 6),(483, 6),(484, 6),(485, 1),(485, 2),(485, 5),(485, 10),(485, 12),(485, 16),(486, 1),(486, 2),(486, 5),(486, 10),(486, 12),(486, 16),(487, 2),(487, 5),(487, 6),(487, 10),(487, 12),(487, 15),(487, 16),(488, 1),(488, 2),(488, 5),(488, 6),(488, 10),(488, 15),(489, 2),(489, 4),(489, 5),(489, 6),(489, 10),(489, 12),(489, 15),(489, 16),(490, 2),(490, 4),(490, 5),(490, 6),(490, 10),(490, 12),(490, 15),(490, 16),(491, 2),(491, 4),(491, 5),(491, 6),(491, 10),(491, 12),(491, 15),(491, 16);




-- select *
-- FROM allergies inner join (
-- select userAlgs.algid
-- FROM users inner join userAlgs
-- ON users.id = userAlgs.uid
-- where users.uid = "lls"
-- );
-- ON allergies.id = userAlgs.algid

-- where (
-- select userAlgs.algid
-- FROM users inner join userAlgs
-- ON users.id = userAlgs.uid
-- where users.uid = "lls";
-- );

select allergies.algname
FROM users right join userAlgs
ON users.id = userAlgs.uid
inner join allergies ON userAlgs.algid = allergies.id
where users.uid = "lls";

select menu.menu_name,menu.img_url, menu.menu_price, menu.menu_ing
FROM menu left join restaurant ON menu.rest_id = restaurant.id
where restaurant.rest_name = "yeon tan bulgogi";


-- 메뉴이름, 알러지 전부 출력하는 쿼리
SELECT menu.menu_name, allergies.algname
FROM menu
LEFT JOIN restaurant ON menu.rest_id = restaurant.id
LEFT JOIN menuAlgs ON menu.id = menuAlgs.menu_id
LEFT JOIN allergies ON menuAlgs.alg_id = allergies.id
WHERE restaurant.rest_name = "yeon tan bulgogi";

-- 메뉴정보, 알러지 한번에 보내는 쿼리
select menu.menu_name ,menu.img_url, menu.menu_price, menu.menu_ing, allergies.algname
FROM menu 
LEFT JOIN restaurant ON menu.rest_id = restaurant.id
LEFT JOIN menuAlgs ON menu.id = menuAlgs.menu_id
LEFT JOIN allergies ON menuAlgs.alg_id = allergies.id
where restaurant.rest_name = 'yeon tan bulgogi';

where users.uid = lls;



#mysql -u root -p -h localhost

use login_lecture;
desc users;
select * from users;


-- --MySQL8.0버전 root 비밀번호 변경
-- ALTER user 'root'@'localhost' IDENTIFIED WITH mysql_native_password BY '변경할 비밀번호';
-- -- 변경사항 저장 (안해도 동작하긴 함)
-- FLUSH PRIVILEGES;


UPDATE restaurant 
SET rest_name = 'test' , address = 'test' , ceo_name = 'test' , tel ='test' 
where uid = 'teol';